In [2]:
%config Completer.use_jedi = False

In [3]:
import pandas as pd

In [7]:
sample = pd.read_csv('sample_data.csv')
sample.head(5)

,account_id,ad_id,event_name,timestamp,platform,category_name,region_name,condition_ad_name,price
0,249683985899310273,-159265360436186278,order,2018-05-16 17:33:18.350333,on_behalf,Cars,Đông Bắc Bộ,Mới,267000000.0
1,2753457128963724056,-6487219347028929285,order,2018-05-04 16:03:08.099983,on_behalf,Cars,Đông Bắc Bộ,Mới,399000000.0
2,2753457128963724056,-6487219347028929285,order,2018-05-03 15:13:42.447070,on_behalf,Cars,Đông Bắc Bộ,Mới,399000000.0
3,-4397739266189556976,4054922453976773054,order,2018-05-23 11:15:25.932663,on_behalf,Cars,Hà Nội,Mới,705000000.0
4,-8143274583979068266,3202538754056800998,order,2018-05-15 17:53:01.634923,on_behalf,Cars,Hà Nội,Mới,696000000.0

# 1- How many distinct account_id on each platform?

In [12]:
sample.groupby('platform').account_id.nunique()

platform
android         10789
desktop_web     11910
ios             10773
mobile_web       6154
on_behalf          36
unknown        108990
Name: account_id, dtype: int64

# 2- How many distinct ad_id on each platform?

In [13]:
sample.groupby('platform').ad_id.nunique()

platform
android         130551
desktop_web     144673
ios             144161
mobile_web       40165
on_behalf           82
unknown        3669226
Name: ad_id, dtype: int64

# 3- For each category_name how many ad is advertised?

In [121]:
sample.groupby('category_name').ad_id.nunique()

category_name
Accessories                    106074
Aircon                              9
Bags                             8510
Bed & bedding                      19
Bicycles                        18087
                                ...
Trucks                          10970
Vehicles parts, Accessories     50158
Video games                       516
Washing machine                     5
Watch                           51624
Name: ad_id, Length: 64, dtype: int64

# 4- Give me top 5 category_name having the highest number of ads?

In [137]:
sample.groupby('category_name').agg(number_of_ads = ('ad_id', 'nunique')).sort_values('number_of_ads', ascending = False).head(5)

                           number_of_ads
category_name
Mobile Phones                     655796
PTY-Houses                        567108
Computers, Laptops                308002
PTY-Land                          297297
TV, Speakers, MP3 players         259987

# 5- Give me top 5 category_name having lowest number of ads?

In [140]:
sample.groupby('category_name').agg(number_of_ads = ('ad_id', 'nunique')).sort_values('number_of_ads').head(5)

                               number_of_ads
category_name
Other pet                                  1
Ornamental plant & decoration              1
Fan                                        1
Lighting                                   2
Washing machine                            5

# 6- Give me the average price for all distinct ads within each category?

In [143]:
sample.groupby('category_name').

averagee_pricee    70294
dtype: int64

In [131]:
sample.groupby('category_name').agg(average_price = ('price', 'mean'))

                             average_price
category_name
Accessories                   8.808542e+06
Aircon                        5.913818e+06
Bags                          8.026387e+07
Bed & bedding                 1.482936e+06
Bicycles                      3.262726e+06
...                                    ...
Trucks                        6.693941e+08
Vehicles parts, Accessories   1.141225e+08
Video games                   2.210399e+06
Washing machine               1.349307e+07
Watch                         3.596161e+07

[64 rows x 1 columns]

# 7- Give me the average price for all distinct ads within each region_name?

In [44]:
sample.groupby(['region_name', 'ad_id']).agg(average_price = ('price', 'mean'))

                                              average_price
region_name             ad_id
Bình Trị Thừa Thiên Huế -9223210020812554718      1500000.0
                        -9223021154882804676      3300000.0
                        -9222427810124298511      2400000.0
                        -9221930762195792095       399000.0
                        -9221440087801565316     15200000.0
...                                                     ...
Đông Nam Bộ              9222961926295084185      7250000.0
                         9223211030031331234       700000.0
                         9223283460874998808      3500000.0
                         9223298048998548035      1800000.0
                         9223358638847625643     12345000.0

[3678082 rows x 1 columns]

# 8- Give details of condition_ad_name for all ads within each category? For example, for category cars, how may ads is 'Moi', 'Da su dung', and 'NaN'

In [40]:
sample.groupby(['category_name', 'condition_ad_name']).agg(number_of_ads = ('condition_ad_name', 'count'))

                                   number_of_ads
category_name   condition_ad_name
Accessories     Mới                         2412
                Đã sử dụng                 23379
Aircon          Mới                            6
                Đã sử dụng                   269
Bags            Mới                         6635
...                                          ...
Video games     Mới                           85
                Đã sử dụng                   330
Washing machine Đã sử dụng                   202
Watch           Mới                        27039
                Đã sử dụng                 47584

[106 rows x 1 columns]

# 9 - Which month in 2018 we see the highest number of (distinct ads)?

In [58]:
# Dùng hàm DatetimeIndex để trích xuất ra ngày, tháng, năm
sample['year'] = pd.DatetimeIndex(sample['timestamp']).year 
sample['month'] = pd.DatetimeIndex(sample['timestamp']).month
sample['hour'] = pd.DatetimeIndex(sample['timestamp']).hour

In [72]:
 sample.groupby(['year', 'month']).agg(number_of_ads = ('ad_id', 'nunique')).sort_values('number_of_ads', ascending = False).head(1)

            number_of_ads
year month
2018 1             753773

# 10- Compare the distinct ads per hour in September, October, and November? Which month and which hour has top ads?

In [105]:
sample_1 = sample.query("month >8 & month<12") # nếu muốn lọc tháng = 9,10,11 thì viết query ntn?

In [110]:
# Compare
compare = sample_1.groupby(['hour', 'month']).agg(number_of_ads = ('ad_id', 'nunique')).sort_values(['hour', 'number_of_ads'], ascending = False)
pd.options.display.max_rows = 10
compare

            number_of_ads
hour month
23   10              2958
     9               2837
     11              2830
22   10              5311
     9               5264
...                   ...
1    9                616
     11               565
0    10              1459
     9               1343
     11              1310

[72 rows x 1 columns]

In [118]:
# Month
sample_1.groupby('month').agg(number_of_ads = ('ad_id', 'nunique')).sort_values('number_of_ads', ascending = False).head(1)

       number_of_ads
month
10            246541

In [114]:
# Hour: tổng số lượng quảng cáo theo từng giờ trong cả 3 tháng
sample_1.groupby('hour').agg(number_of_ads = ('ad_id', 'nunique')).sort_values('number_of_ads', ascending = False).head(1)

      number_of_ads
hour
9             91100

In [120]:
# Hour: tổng số lượng quảng cáo theo từng giờ trong từng tháng
# Đề yêu cầu số liệu nào????
compare.sort_values('number_of_ads', ascending = False).head(1)

            number_of_ads
hour month
9    10             33858